In [33]:
import pandas as pd
import scipy.stats as stats
import numpy as np

In [34]:
data=pd.read_csv('D:/ictak_dsa/Students_Performance.csv')

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [11]:
# 1a)  Find out how many males and females participated in the test
data.groupby('gender').size()

gender
female    518
male      482
dtype: int64

In [16]:
#1b) What do you think about the students' parental level of education?
data['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [20]:
# 1c) Who scores the most on average for math, reading and writing based on i. Gender ii. Test preparation course

data.groupby(['gender'])['reading score','math score','writing score'].mean()

C:\Users\USER\AppData\Local\Temp\ipykernel_6896\3938626199.py:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data.groupby(['gender'])['reading score','math score','writing score'].mean()

        reading score  math score  writing score
gender
female      72.590734   63.376448      72.467181
male        65.545643   68.821577      63.446058

In [21]:
#1c) based on Test preparation course

data.groupby(['test preparation course'])['reading score','math score','writing score'].mean()

C:\Users\USER\AppData\Local\Temp\ipykernel_6896\1133813175.py:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data.groupby(['test preparation course'])['reading score','math score','writing score'].mean()

                         reading score  math score  writing score
test preparation course
completed                    74.175978    69.96648      74.684358
none                         66.417445    63.78972      64.457944

In [11]:
#1d) What do you think about the scoring variation for math, reading and writing based on i. Gender ii. Test preparation course

# variance based on test preparation
data.groupby(['test preparation course'])[['reading score','math score','writing score']].var()

                         reading score  math score  writing score
test preparation course
completed                   183.265864  210.884027     175.202612
none                        213.419851  246.668662     226.251739

In [14]:
#1d) variance based on gender

data.groupby(['gender'])[['reading score','math score','writing score']].var()

        reading score  math score  writing score
gender
female     207.677438  256.958593     220.369327
male       200.211010  211.889097     202.413924

In [18]:
#1e)  The management needs your help to give bonus points to the top 25% of students based on their math score, 
      # so how will you help the management to achieve this.

score=np.percentile(data['math score'],75)
top25=data[data['math score']>score]
top25['bonus']=10
top25

C:\Users\USER\AppData\Local\Temp\ipykernel_5124\534285077.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  top25['bonus']=10

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,bonus
430,female,group A,some college,standard,completed,78,87,91,10
431,female,group B,bachelor's degree,free/reduced,none,78,79,76,10
432,female,group D,bachelor's degree,standard,none,78,82,79,10
433,female,group D,high school,standard,none,78,81,80,10
434,female,group D,bachelor's degree,free/reduced,none,78,90,93,10
...,...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81,10
996,male,group A,some college,standard,completed,100,96,86,10
997,male,group D,some college,standard,completed,100,97,99,10
998,male,group E,associate's degree,free/reduced,completed,100,100,93,10
999,male,group E,bachelor's degree,standard,completed,100,100,100,10

In [21]:
#Case Study on Testing of Hypothesis

#Loading dataset

data2=pd.read_csv('D:/ictak_dsa/Sales_add.csv')

In [4]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 5 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Month                           22 non-null     object
 1   Region                          22 non-null     object
 2   Manager                         22 non-null     object
 3   Sales_before_digital_add(in $)  22 non-null     int64
 4   Sales_After_digital_add(in $)   22 non-null     int64
dtypes: int64(2), object(3)
memory usage: 1012.0+ bytes

In [32]:
#2a)The company wishes to clarify whether there is any increase in sales after stepping into digital marketing.

f_stat,p_val = stats.f_oneway(data2['Sales_before_digital_add(in $)'],data2['Sales_After_digital_add(in $)'])
alpha = 0.05
if p_val < alpha:
    print('Reject null hypothesis:\nThere is significant difference between means before and after digital marketing')
else:
    print('Do not reject null hypothesis:\nThere is no significant difference between means before and after digital marketing')

Reject null hypothesis:
There is significant difference between means before and after digital marketing

In [27]:
#2b) The company needs to check whether there is any dependency between the features “Region” and “Manager”.

contingencytable=pd.crosstab(data2['Region'],data2['Manager'])
chi_sq_statistic,p_value,dof,expected=stats.chi2_contingency(contingencytable)
alpha=0.05
if p_value<alpha:
    print('Reject null hypothesis. Region and Manager has dependency')
else:
    print('Cannot reject null hypothesis.Region and Manager are independent')

Cannot reject null hypothesis.Region and Manager are independent